Revit 2027 API
ExternalFileUtils.GetFileBasedTempFolder Method
 Gets a temp folder based on the given file name
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetFileBasedTempFolder(
	string filename
)
Public Shared Function GetFileBasedTempFolder (
	filename As String
) As String
public:
static String^ GetFileBasedTempFolder(
	String^ filename
)
static member GetFileBasedTempFolder :
        filename : string -> string
Parameters
filename String
Return Value
String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalFileUtils Class
Autodesk.Revit.DB Namespace